W7D3/musicapp/app/controllers/bands_controller.rb

INSERT INTO "bands" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "The Beatles"], ["created_at", "2021-04-06 21:28:45.985919"], ["updated_at", "2021-04-06 21:28:45.985919"]]
---
    def create
        @band = Band.new(band_params)
        if @band.save!

SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "bands" SET "name" = $1, "updated_at" = $2 WHERE "bands"."id" = $3  [["name", "Neutral Milk Motel"], ["updated_at", "2021-04-06 21:39:48.483170"], ["id", 1]]
---
    def update
        @band = Band.find(params[:id])
        if @band.update_attributes(band_params)