W7D3/musicapp/app/models/user.rb

INSERT INTO "users" ("session_token", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["session_token", "YZJvohjxaqnw-x9TBuLTZg"], ["created_at", "2021-04-06 19:09:59.468044"], ["updated_at", "2021-04-06 19:09:59.468044"]]
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "zcleRQvXnpxZbEsIuQSjeA"], ["updated_at", "2021-04-06 20:20:25.573547"], ["id", 1]]
---
    def reset_session_token
        self.session_token = User.generate_session_token
        self.save!